# Dotfiles Brewfile
# Install with: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "nikitabobko/tap"  # AeroSpace window manager

# Core tools
brew "git"
brew "zsh"
brew "curl"
brew "wget"

# Terminal & Shell
brew "tmux"
brew "zsh-completions"

# Editor
brew "neovim"

# Search & Navigation
brew "fzf"
brew "ripgrep"
brew "fd"
brew "tree"
brew "jq"

# Development tools
brew "pyenv"          # Python version management
brew "nvm"            # Node version management
brew "node"           # Node.js (for claude-code CLI)
brew "gh"             # GitHub CLI
brew "yt-dlp"         # YouTube downloader (from aliases)

# Claude Orchestration dependencies
brew "sqlite"         # Database for orchestration state

# System monitoring
brew "bpytop"         # Better top (from aliases)
brew "htop"

# Casks - Applications
cask "ghostty"        # Terminal emulator
cask "ollama"         # LLM (from aliases)

# Casks - Fonts
cask "font-ibm-plex-mono"
cask "font-blex-mono-nerd-font"

# Window management
cask "nikitabobko/tap/aerospace"  # i3-like window manager for macOS

# Optional: Uncomment if you use these
# cask "tailscale"    # VPN
