# Dotfiles Brewfile
# Install with: brew bundle install

# Taps
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
tap "stripe/stripe-cli"

# Core
brew "coreutils"
brew "curl"
brew "git"
brew "zsh"

# Terminal & Shell
brew "tmux"
brew "zellij"

# Build tools (neovim from source, etc.)
brew "cmake"
brew "ninja"

# Search & Navigation
brew "bat"
brew "fd"
brew "jq"
brew "ripgrep"
brew "tree"

# Development
brew "gh"
brew "libpq"
brew "marksman"
brew "pyenv"
brew "python@3.12"
brew "stripe/stripe-cli/stripe"

# Media & OCR
brew "ffmpeg"
brew "tesseract"
brew "yt-dlp"

# System
brew "bpytop"
brew "fastfetch"

# Editors
brew "railwaycat/emacsmacport/emacs-mac@29"

# Fonts
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"

# Casks
cask "nikitabobko/tap/aerospace"
cask "gpg-suite"
cask "localsend"
